// 질문 리스트
let qList = [
    "가장 흥미있는 수업은?",
    "에러 발생! 해결하고 싶은 에러는?",
    "웹사이트를 완성했다! 가장 듣기 좋은 칭찬은?",
    "영양제를 구입하려고 합니다. 가장 먼저 고려할 것은?",
    "망해가는 빵집을 인수했다! 당신이 가장 먼저 할 일은?"
];

// 선택지 리스트
let aList = [
    [
        "Unity, Unreal Engine",
        "Spring, Node.js, SQL",
        "Swift, Android",
        "Html, Css, React",
        "Machine Learning, Python"
    ],
    [
        "화면 로딩 딜레이",
        "맞춤형 광고 서비스 오류",
        "뒤틀린 폰트와 깨진 이미지",
        "오류 발생 시 실행되는 게임",
        "업데이트 오류"
    ],
    [
        "진짜 이쁘다! 너가 만들었어??",
        "동시접속이 천 명인데 이렇게 빠르다고??",
        "와 내가 많이 보던 광고가 나오네?",
        "이 미니게임 때문에 2박 3일이 훌쩍 지나갔어!",
        "아이디어도 참신하고 이용하기 편리한거 같아!"
    ],
    [
        "효과 좋은게 짱! 고농축 영양제로 가자!",
        "화려하고 아름다운 상세 페이지? 이건 못참지!",
        "믿을 수 있는게 맞나..? 성분을 꼼꼼히 따져봐야겠어.",
        "맛 없으면 안먹어! 젤리 영양제 어딨지?",
        "동일한 영양제 함량을 제조사별로 나누어서 봐야겠어!"
    ],
    [
        "어떤 빵이 제일 잘 팔릴까? 수요조사를 해야겠어.",
        "뭐든 장비빨이지! 최고급 오븐 바로 구매!",
        "빵이란 자고로 맛이지! 내가 김탁구다!",
        "감생감죽! 감성적인 인테리어와 플레이팅으로 사로잡겠어!",
        "가장 편하고 빠른 레시피를 찾아서 개꿀빨기!"
    ]
];

//게임 : 1
//백엔드 : 2
//앱 : 3
//프론트 : 4
//인공지능 : 5
let scores = [
    [1, 2, 3, 4, 5],
    [2, 5, 4, 1, 3],
    [4, 2, 5, 1, 3],
    [3, 4, 2, 1, 5],
    [5, 1, 2, 4, 3]
];